In [2]:
import pandas as pd

In [4]:
persondetail=[['Farhan','Shafiq',29,'Male'],
             ['Rajib','Hawlader',45,'Male'],
             ['Jhinuk','Afrin',24,'Female'],
             ['Nabila','Momtarin',23,'Female'],
             ['Mahmud','Sarker',29,'Male'],
             ['Nila','Merchant',27,'Female']
        ]
df=pd.DataFrame(persondetail,columns=['First Name', 'Last Name','Age','Gender'])
df

  First Name Last Name  Age  Gender
0     Farhan    Shafiq   29    Male
1      Rajib  Hawlader   45    Male
2     Jhinuk     Afrin   24  Female
3     Nabila  Momtarin   23  Female
4     Mahmud    Sarker   29    Male
5       Nila  Merchant   27  Female

In [5]:
df.shape ##row/and column finding

(6, 4)

In [7]:
df.head(2) ## head is using to finding the given number of rows from upper side

  First Name Last Name  Age Gender
0     Farhan    Shafiq   29   Male
1      Rajib  Hawlader   45   Male

In [11]:
df.tail(2) ## tail is using to finding the given number of rows from lower side

  First Name Last Name  Age  Gender
4     Mahmud    Sarker   29    Male
5       Nila  Merchant   27  Female

In [12]:
df[2:5] #using this pattern will print the columns from starting from column to (ending-1)---->here its start from column 2 and end in 4 cause this patter isn't accept the last one

  First Name Last Name  Age  Gender
2     Jhinuk     Afrin   24  Female
3     Nabila  Momtarin   23  Female
4     Mahmud    Sarker   29    Male

In [13]:
df['Age'] ### same is df.Age

0    29
1    45
2    24
3    23
4    29
5    27
Name: Age, dtype: int64

In [14]:
type(df['Age']) ## which type we will find by this

pandas.core.series.Series

In [15]:
df[['First Name','Age','Gender']] ##we will print the only selected column in this way

  First Name  Age  Gender
0     Farhan   29    Male
1      Rajib   45    Male
2     Jhinuk   24  Female
3     Nabila   23  Female
4     Mahmud   29    Male
5       Nila   27  Female

In [16]:
df['Age'].max() #max value of the Age columns

45

In [17]:
df['Age'].min() #min value of the Age columns

23

In [18]:
df.describe() ## statics result will show

             Age
count   6.000000
mean   29.500000
std     7.993748
min    23.000000
25%    24.750000
50%    28.000000
75%    29.000000
max    45.000000

In [20]:
df.set_index('Age') ## in this way we can make a column as index number

    First Name Last Name  Gender
Age
29      Farhan    Shafiq    Male
45       Rajib  Hawlader    Male
24      Jhinuk     Afrin  Female
23      Nabila  Momtarin  Female
29      Mahmud    Sarker    Male
27        Nila  Merchant  Female

In [21]:
df.reset_index(inplace=True) ## We can reset the index